app/controllers/manage_controller.rb

SELECT * FROM `user_agents` WHERE (`user_agents`.`user_agent` = 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.1.3) Gecko/20090824 Firefox/3.5.3 (.NET CLR 3.5.30729)') LIMIT 1
---
  def edit
    @ua = params[:ua_string]

      # record it and get the hit count
      @db  = UserAgent.find :first, :conditions => {:user_agent => @ua}