app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`) VALUES('2010-10-09 19:35:08', '$2a$10$3/iNMJeQ.ME9E6A9TBnhKO1nDX83PIzN2hYrWGEwZaZhrH2VE5pRq', '2010-10-09 19:35:08', 'nfriedly')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save