app/controllers/user_agents_controller.rb

SELECT * FROM `user_agents` WHERE (`user_agents`.`user_agent` = 'Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US; rv:1.9.2.10) Gecko/20100914 Firefox/3.6.10') LIMIT 1
UPDATE `user_agents` SET `updated_at` = '2010-10-09 19:19:00', `hits` = 27 WHERE `id` = 1035
---
    def index
      @ua ||= request.headers['User-Agent']

      _check @ua

      # record it and get the hit count
      @db  = UserAgent.find :first, :conditions => {:user_agent => @ua}
      if @db
        @db.increment! :hits